; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl1)
	(at plane2 city5)
	(fuel-level plane2 fl0)
	(at plane3 city1)
	(fuel-level plane3 fl1)
	(at plane4 city0)
	(fuel-level plane4 fl6)
	(at person1 city8)
	(at person2 city3)
	(at person3 city7)
	(at person4 city8)
	(at person5 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city1)
	(at person1 city3)
	(at person2 city6)
	(at person3 city3)
	(at person4 city4)
	(at person5 city5)
	))

)

; plan
1. (fly plane4 city0 city3 fl6 fl5)
   deleted: (at plane4 city0) (fuel-level plane4 fl6)
   added: (at plane4 city3) (fuel-level plane4 fl5)
   goals met: 1 of 6
2. (board person2 plane4 city3)
   deleted: (at person2 city3)
   added: (in person2 plane4)
   goals met: 1 of 6
3. (zoom plane4 city3 city6 fl5 fl4 fl3)
   deleted: (at plane4 city3) (fuel-level plane4 fl5)
   added: (at plane4 city6) (fuel-level plane4 fl3)
   goals met: 1 of 6
4. (debark person2 plane4 city6)
   deleted: (in person2 plane4)
   added: (at person2 city6)
   goals met: 2 of 6
5. (fly plane1 city6 city4 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 2 of 6
6. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   goals met: 2 of 6
7. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 2 of 6
8. (fly plane1 city4 city5 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 2 of 6
9. (debark person5 plane1 city5)
   deleted: (in person5 plane1)
   added: (at person5 city5)
   goals met: 3 of 6
10. (fly plane3 city1 city7 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 2 of 6
11. (zoom plane4 city6 city8 fl3 fl2 fl1)
   deleted: (at plane4 city6) (fuel-level plane4 fl3)
   added: (at plane4 city8) (fuel-level plane4 fl1)
   goals met: 2 of 6
12. (board person4 plane4 city8)
   deleted: (at person4 city8)
   added: (in person4 plane4)
   goals met: 2 of 6
13. (board person1 plane4 city8)
   deleted: (at person1 city8)
   added: (in person1 plane4)
   goals met: 2 of 6
14. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 2 of 6
15. (board person3 plane3 city7)
   deleted: (at person3 city7)
   added: (in person3 plane3)
   goals met: 2 of 6
16. (fly plane4 city8 city3 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city3) (fuel-level plane4 fl0)
   goals met: 2 of 6
17. (refuel plane4 city3 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 2 of 6
18. (debark person1 plane4 city3)
   deleted: (in person1 plane4)
   added: (at person1 city3)
   goals met: 3 of 6
19. (fly plane4 city3 city4 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 3 of 6
20. (debark person4 plane4 city4)
   deleted: (in person4 plane4)
   added: (at person4 city4)
   goals met: 4 of 6
21. (fly plane3 city7 city3 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 4 of 6
22. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 6
23. (debark person3 plane3 city3)
   deleted: (in person3 plane3)
   added: (at person3 city3)
   goals met: 5 of 6
24. (fly plane3 city3 city1 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 6 of 6
